#encoding=utf-8
import json
split_codes = [33, 34, 35, 39, 44, 45, 46, 58, 59, 61, 63, 12290, 65281, 65292, 30340]
keyword = "abcd的ef,gh.dad。"
for code in split_codes:
    if chr(code) in keyword:
        keyword = keyword.replace(chr(code), " ")
words = keyword.strip().split(" ")
print(words)
database = {
        "研究生课程建设情况统计": {
            "编号": [],
            "学院": [],
            "课程名称": [],
            "课程类别": [],
            "课程建设类别": [],
            "建设起止年份": [],
            "负责人": [],
            "其他说明": []
        },
        "省级课程思政团队建设情况统计": {
            "编号": [],
            "学院": [],
            "团队名称": [],
            "建设起止年份": [],
            "负责人": [],
            "其他说明": []
        },
        "省级课程思政研究中心建设情况统计": {
            "编号": [],
            "学院": [],
            "中心名称": [],
            "建设起止年份": [],
            "负责人": [],
            "其他说明": []
        },
        "研究生教材建设情况统计": {
            "编号": [],
            "学院": [],
            "教材名称": [],
            "出版社": [],
            "出版年份": [],
            "作者": [],
            "作者职称": [],
            "是否国家级/省部级/学校规划教材": [],
            "获奖说明": []
        },
        "研究生教改项目统计": {
            "编号": [],
            "学院": [],
            "负责人": [],
            "职称": [],
            "教改项目名称": [],
            "立项年度": [],
            "类别": [],
            "来源": [],
            "状态": []
        }
    }
with open("database.json", "w") as f:
    json.dump(database, f)
